Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM3210E-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                          |I2C1|I2C2|SPI1 |SPI2 |SPI3 |USART1|USART2|USART3|ADC1 |TIM (PWM)                                 |USB|SDIO|RCC       |SYS           
PA0 , // |WAKEUP [B2 Blue Button]              |    |    |     |     |     |      |      |      |*IN0 |*TIM5_CH1 *TIM2_CH1                       |   |    |          |              
PA1 , // |USART2_RTS [ST3232E_T2IN]            |    |    |     |     |     |      |      |      |*IN1 |*TIM5_CH2 *TIM2_CH2                       |   |    |          |              
PA2 , // |USART2_TX [ST3232E_T1IN]             |    |    |     |     |     |      |*TX   |      |*IN2 |*TIM5_CH3 *TIM9_CH1 *TIM2_CH3             |   |    |          |              
PA3 , // |USART2_RX [ST3232_R1OUT]             |    |    |     |     |     |      |*RX   |      |*IN3 |*TIM5_CH4 *TIM9_CH2 *TIM2_CH4             |   |    |          |              
PA4 , // |                                     |    |    |     |     |     |      |      |      |*IN4 |                                          |   |    |          |              
PA5 , // |SPI1_SCK [M25P64_C]                  |    |    |*SCK |     |     |      |      |      |*IN5 |                                          |   |    |          |              
PA6 , // |SPI1_MISO [M25P64_Q]                 |    |    |*MISO|     |     |      |      |      |*IN6 |*TIM3_CH1 *TIM13_CH1                      |   |    |          |              
PA7 , // |SPI1_MOSI [M25P64_D]                 |    |    |*MOSI|     |     |      |      |      |*IN7 |+TIM1_CH1N *TIM8_CH1N *TIM3_CH2 *TIM14_CH1|   |    |          |              
PA8 , // |                                     |    |    |     |     |     |      |      |      |     |*TIM1_CH1                                 |   |    |          |              
PA9 , // |USART1_TX [ST3232E_T1IN]             |    |    |     |     |     |*TX   |      |      |     |*TIM1_CH2                                 |   |    |          |              
PA10, // |USART1_RX [ST3232E_R1OUT]            |    |    |     |     |     |*RX   |      |      |     |*TIM1_CH3                                 |   |    |          |              
PA11, // |USB_DM                               |    |    |     |     |     |      |      |      |     |*TIM1_CH4                                 |*DM|    |          |              
PA12, // |USB_DP                               |    |    |     |     |     |      |      |      |     |                                          |*DP|    |          |              
PA13, // |TMS/SWDIO                            |    |    |     |     |     |      |      |      |     |                                          |   |    |          |*JTMS-SWDIO   
PA14, // |TCK/SWCLK                            |    |    |     |     |     |      |      |      |     |                                          |   |    |          |*JTCK-SWCLK   
PA15, // |TDI                                  |    |    |     |     |     |      |      |      |     |+TIM2_CH1                                 |   |    |          |*JTDI         
PB0 , // |                                     |    |    |     |     |     |      |      |      |*IN8 |*TIM8_CH2N *TIM3_CH3 +TIM1_CH2N           |   |    |          |              
PB1 , // |                                     |    |    |     |     |     |      |      |      |*IN9 |*TIM3_CH4 +TIM1_CH3N *TIM8_CH3N           |   |    |          |              
PB2 , // |SPI1_CS [M25P64_S]                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PB3 , // |TDO/SWO                              |    |    |+SCK |     |*SCK |      |      |      |     |+TIM2_CH2                                 |   |    |          |*JTDO-TRACESWO
PB4 , // |TRST                                 |    |    |+MISO|     |*MISO|      |      |      |     |+TIM3_CH1                                 |   |    |          |*NJTRST       
PB5 , // |TemperatureSensor_INT [STLM75_OS/INT]|    |    |+MOSI|     |*MOSI|      |      |      |     |+TIM3_CH2                                 |   |    |          |              
PB6 , // |I2C_SCK [AK4343_CCLK/SCL]            |*SCL|    |     |     |     |+TX   |      |      |     |*TIM4_CH1                                 |   |    |          |              
PB7 , // |I2C_SDA [AK4343_CDTI/SDA]            |*SDA|    |     |     |     |+RX   |      |      |     |*TIM4_CH2                                 |   |    |          |              
PB8 , // |CAN_RX [SN65HVD_R]                   |+SCL|    |     |     |     |      |      |      |     |*TIM10_CH1 *TIM4_CH3                      |   |*D4 |          |              
PB9 , // |CAN_TX [SN65HVD_D]                   |+SDA|    |     |     |     |      |      |      |     |*TIM4_CH4 *TIM11_CH1                      |   |*D5 |          |              
PB10, // |                                     |    |*SCL|     |     |     |      |      |*TX   |     |+TIM2_CH3                                 |   |    |          |              
PB11, // |                                     |    |*SDA|     |     |     |      |      |*RX   |     |+TIM2_CH4                                 |   |    |          |              
PB12, // |I2S_CMD [AK4343_LRCK]                |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PB13, // |I2S_CK [AK4343_BICK]                 |    |    |     |*SCK |     |      |      |      |     |*TIM1_CH1N                                |   |    |          |              
PB14, // |USB_Disconnect                       |    |    |     |*MISO|     |      |      |      |     |*TIM1_CH2N *TIM12_CH1                     |   |    |          |              
PB15, // |I2S_DIN [AK4343_SDTI]                |    |    |     |*MOSI|     |      |      |      |     |*TIM1_CH3N *TIM12_CH2                     |   |    |          |              
PC0 , // |                                     |    |    |     |     |     |      |      |      |*IN10|                                          |   |    |          |              
PC1 , // |                                     |    |    |     |     |     |      |      |      |*IN11|                                          |   |    |          |              
PC2 , // |                                     |    |    |     |     |     |      |      |      |*IN12|                                          |   |    |          |              
PC3 , // |                                     |    |    |     |     |     |      |      |      |*IN13|                                          |   |    |          |              
PC4 , // |Potentiometer [RV1]                  |    |    |     |     |     |      |      |      |*IN14|                                          |   |    |          |              
PC5 , // |                                     |    |    |     |     |     |      |      |      |*IN15|                                          |   |    |          |              
PC6 , // |I2S_MCK [AK4343_MCK1]                |    |    |     |     |     |      |      |      |     |*TIM8_CH1 +TIM3_CH1                       |   |*D6 |          |              
PC7 , // |                                     |    |    |     |     |     |      |      |      |     |+TIM3_CH2 *TIM8_CH2                       |   |*D7 |          |              
PC8 , // |MicroSDCard_D0                       |    |    |     |     |     |      |      |      |     |+TIM3_CH3 *TIM8_CH3                       |   |*D0 |          |              
PC9 , // |MicroSDCard_D1                       |    |    |     |     |     |      |      |      |     |+TIM3_CH4 *TIM8_CH4                       |   |*D1 |          |              
PC10, // |MicroSDCard_D2                       |    |    |     |     |+SCK |      |      |+TX   |     |                                          |   |*D2 |          |              
PC11, // |MicroSDCard_D3                       |    |    |     |     |+MISO|      |      |+RX   |     |                                          |   |*D3 |          |              
PC12, // |MicroSDCard_CLK                      |    |    |     |     |+MOSI|      |      |      |     |                                          |   |*CK |          |              
PC13, // |Anti_Tamper [B3 Blue Button]         |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PC14, // |                                     |    |    |     |     |     |      |      |      |     |                                          |   |    |*OSC32_IN |              
PC15, // |                                     |    |    |     |     |     |      |      |      |     |                                          |   |    |*OSC32_OUT|              
PD0 , // |D2                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PD1 , // |D3                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PD2 , // |MicroSDCard_CMD                      |    |    |     |     |     |      |      |      |     |                                          |   |*CMD|          |              
PD3 , // |JOY_DOWN [MT008-A_DOWN]              |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PD4 , // |FSMC_NOE                             |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PD5 , // |FSMC_NWE                             |    |    |     |     |     |      |+TX   |      |     |                                          |   |    |          |              
PD6 , // |FSMC_NWAIT                           |    |    |     |     |     |      |+RX   |      |     |                                          |   |    |          |              
PD7 , // |FSMC_NCE2 [NandFlash_E]              |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PD8 , // |D13                                  |    |    |     |     |     |      |      |+TX   |     |                                          |   |    |          |              
PD9 , // |D14                                  |    |    |     |     |     |      |      |+RX   |     |                                          |   |    |          |              
PD10, // |D15                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PD11, // |A16                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PD12, // |A17                                  |    |    |     |     |     |      |      |      |     |+TIM4_CH1                                 |   |    |          |              
PD13, // |A18                                  |    |    |     |     |     |      |      |      |     |+TIM4_CH2                                 |   |    |          |              
PD14, // |D0                                   |    |    |     |     |     |      |      |      |     |+TIM4_CH3                                 |   |    |          |              
PD15, // |D1                                   |    |    |     |     |     |      |      |      |     |+TIM4_CH4                                 |   |    |          |              
PE0 , // |FMC_NBL0 [SRAM_BLE]                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PE1 , // |FMC_NBL1 [SRAM_BHE]                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PE2 , // |                                     |    |    |     |     |     |      |      |      |     |                                          |   |    |          |*TRACECLK     
PE3 , // |A19                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |*TRACED0      
PE4 , // |A20                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |*TRACED1      
PE5 , // |A21                                  |    |    |     |     |     |      |      |      |     |+TIM9_CH1                                 |   |    |          |*TRACED2      
PE6 , // |A22                                  |    |    |     |     |     |      |      |      |     |+TIM9_CH2                                 |   |    |          |*TRACED3      
PE7 , // |D                                    |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PE8 , // |D5                                   |    |    |     |     |     |      |      |      |     |+TIM1_CH1N                                |   |    |          |              
PE9 , // |D6                                   |    |    |     |     |     |      |      |      |     |+TIM1_CH1                                 |   |    |          |              
PE10, // |D7                                   |    |    |     |     |     |      |      |      |     |+TIM1_CH2N                                |   |    |          |              
PE11, // |D8                                   |    |    |     |     |     |      |      |      |     |+TIM1_CH2                                 |   |    |          |              
PE12, // |D9                                   |    |    |     |     |     |      |      |      |     |+TIM1_CH3N                                |   |    |          |              
PE13, // |D10                                  |    |    |     |     |     |      |      |      |     |+TIM1_CH3                                 |   |    |          |              
PE14, // |D11                                  |    |    |     |     |     |      |      |      |     |+TIM1_CH4                                 |   |    |          |              
PE15, // |D12                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF0 , // |A0                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF1 , // |A1                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF2 , // |A2                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF3 , // |A3                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF4 , // |A4                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF5 , // |A5                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF6 , // |LED1 [LD1 Green Led]                 |    |    |     |     |     |      |      |      |     |+TIM10_CH1                                |   |    |          |              
PF7 , // |LED2 [LD2 Orange Led]                |    |    |     |     |     |      |      |      |     |+TIM11_CH1                                |   |    |          |              
PF8 , // |LED3 [LD3 Red Led]                   |    |    |     |     |     |      |      |      |     |+TIM13_CH1                                |   |    |          |              
PF9 , // |LED4 [LD4 Blue Led]                  |    |    |     |     |     |      |      |      |     |+TIM14_CH1                                |   |    |          |              
PF10, // |                                     |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF11, // |MicroSDCard_Detect                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF12, // |A6                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF13, // |A7                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF14, // |A8                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PF15, // |A9                                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG0 , // |A10                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG1 , // |A11                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG2 , // |A12                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG3 , // |A13                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG4 , // |A14                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG5 , // |A15                                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG6 , // |                                     |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG7 , // |JOY_SEL [MT008-A_SEL]                |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG8 , // |User_Button [B4 Blue Button]         |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG9 , // |FSMC_NE2 [NorFlash_E]                |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG10, // |FSMC_NE3 [Sram_CE]                   |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG11, // |Audio_PDN [AK4343_PDN]               |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG12, // |FSMC_NE4 [TFTLCD_CS]                 |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG13, // |JOY_RIGHT [MT008-A_RIGHT]            |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG14, // |JOY_LEFT [MT008-A_LEFT]              |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
PG15, // |JOY_UP [MT008-A_UP]                  |    |    |     |     |     |      |      |      |     |                                          |   |    |          |              
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

